"""Модуль який робить документацію для язика програмування 'Kotlin'

УВАГА: Модуль у розробці, окремі функції не працюють.

1.Модуль робить документацію з програмних кодів 
язика програмування 'Kotlin'
2.Модуль можна імпортувати або запустити
3.Модуль не потребує сторонніх бібліотек
4.Модуль може опрацювати:
    a) Окремий файл - у розробці до верії 1.0
    b) Файли каталогу - у розробці до верії 2.0
    с) Файли каталогу та підкаталогів - у розробці до верії 3.0
    d) Файли з git репозиторію - у розробці до верії 4.0
5.Модуль генерує документацію у вигляді html сторінок
6.Модуль генерує html сторінки з використанням технології bootstrap

"""

# TODO Збір інформації з файлу
# TODO Збір інформації з файлів каталогу
# TODO Збір інформації з файлів каталогу та підкаталогів
# TODO Збір інформації з git репозиторію
# TODO Генерування документації у html вигляді
# TODO Підключити bootstrap 4.3.x
# TODO Аргументи запуску цього модуля